Show / Hide Table of Contents
Class SubStructure
SubStructure
Inheritance
System.Object
OpenObject
OpenElementId
SubStructure
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.SubStructure,CI.StructuralElements", "CI.StructModel.Structure.ISubStructure,CI.BasicTypes")]
public class SubStructure : OpenElementId
Constructors
Improve this Doc   View Source
SubStructure()
Constructor
Declaration
public SubStructure()
Properties
Improve this Doc   View Source
Geometry
Geometry
Declaration
public SubStructureGeometry Geometry { get; set; }
Property Value
 Type |  Description
 SubStructureGeometry
Improve this Doc   View Source
Loading
Loading
Declaration
public SubStructureLoading Loading { get; set; }
Property Value
 Type |  Description
 SubStructureLoading
Improve this Doc   View Source
Name
Name
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source